---
title: 'CCNA: IPv6'
date: 2016-10-10T01:45:10+00:00
author: gerryw1389
layout: single
classes: wide
permalink: /2016/10/ccna-ipv6
categories:
  - Networking
tags:
  - Router
  - CCNA
---
<!--more-->

### Description:

Ipv6 commands for Cisco Routers

#### Global IPv6 commands:

   ```tcl
   R1(config)#ipv6 unicast-routing
   ```

#### Interface IPv6 commands:

   ```tcl
   R1(config)#ipv6 unicast-routing

   R1(config)#interface FastEthernet0/0

   R1(config-if)# ipv6 address 2001:DB8:0:1::/64 eui-64 

   # Configures a link-local address on the interface that is used instead of the ...
   # link-local address that is automatically configured when IPv6 is enabled on the interface. 
   # Just remember it needs to be in the FE80::/10 range.
   R1(config-if)# ipv6 address fe80:1234:abcd:1::3 link-local 

   # Adds an IPv6 anycast address.
   R1(config-if)# ipv6 address 2001:DB8:0:1::/64 anycast 

   # Enables automatic configuration of IPv6 addresses using stateless 
   # autoconfiguration on an interface and enables IPv6 processing on the interface.
   R1(config-if)# ipv6 address autoconfig
   ```

#### Show Commands:

   ```tcl
   show ipv6 interface brief
   show ipv6 route
   ```


